app/views/articles/_article.html.erb

        <div class="col-md-6">
          <%= article.comments.count %> comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]