app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (lower(title) LIKE '%post%')  ORDER BY created_at DESC
---
  def index
    @articles = Article.search(params[:search]).order("created_at DESC")

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT 1  [["name", "test"]]
SELECT "articles".* FROM "articles" INNER JOIN "articles_tags" ON "articles"."id" = "articles_tags"."article_id" WHERE "articles_tags"."tag_id" = $1  ORDER BY created_at DESC  [["tag_id", 1]]
---
  def hashtag
    tag = Tag.find_by(name: params[:name])
    @articles = tag.articles.order("created_at DESC")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  ORDER BY created_at DESC  [["user_id", 1]]
---
  def user
    user = User.find(params[:user_id])
    @articles = user.articles.order("created_at DESC")

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test user"], ["body", "test test test"], ["user_id", 1], ["created_at", "2016-06-23 18:25:36.295233"], ["updated_at", "2016-06-23 18:25:36.295233"]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "test test test #test"], ["updated_at", "2016-06-21 17:14:24.622745"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)