app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aaaaaaaaaaaaaaaa"], ["body", "bbbbbbbbbbbbbbbbbb"], ["article_id", 2], ["created_at", "2016-06-20 18:32:04.613311"], ["updated_at", "2016-06-20 18:32:04.613311"]]