app/views/application/_sidebar.html.erb

		<h3>Hashtag</h3>
		<% @all_tags = Tag.all %>
---
SELECT "tags".* FROM "tags"

			<% else %>
				<%= link_to "#{t.name} (#{t.articles.count})", "/articles/hashtag/#{t.name}" %>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "articles_tags" ON "articles"."id" = "articles_tags"."article_id" WHERE "articles_tags"."tag_id" = $1  [["tag_id", 1]]

		<h3>Last articles</h3>
		<% @last_articles = Article.order("created_at DESC").limit(5) %>
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 5